Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR35_DFP/2.1.55/svd/ATSAMR35J17B.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>OSCCTRL</name>
         <version>U21191.1.0</version>
         <description>Oscillators Control</description>
         <groupName>OSCCTRL</groupName>
         <prependToName>OSCCTRL_</prependToName>
         <baseAddress>0x40000C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x3D</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC16MRDY</name>
                     <description>OSC16M Ready Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLCKR</name>
                     <description>DPLL Lock Rise Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLCKF</name>
                     <description>DPLL Lock Fall Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLTO</name>
                     <description>DPLL Time Out Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLDRTO</name>
                     <description>DPLL Ratio Ready Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC16MRDY</name>
                     <description>OSC16M Ready Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLCKR</name>
                     <description>DPLL Lock Rise Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLCKF</name>
                     <description>DPLL Lock Fall Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLTO</name>
                     <description>DPLL Time Out Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLDRTO</name>
                     <description>DPLL Ratio Ready Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC16MRDY</name>
                     <description>OSC16M Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLCKR</name>
                     <description>DPLL Lock Rise</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLCKF</name>
                     <description>DPLL Lock Fall</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLTO</name>
                     <description>DPLL Timeout</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLDRTO</name>
                     <description>DPLL Ratio Ready</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Power and Clocks Status</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC16MRDY</name>
                     <description>OSC16M Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLCKR</name>
                     <description>DPLL Lock Rise</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLCKF</name>
                     <description>DPLL Lock Fall</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLTO</name>
                     <description>DPLL Timeout</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLLLDRTO</name>
                     <description>DPLL Ratio Ready</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XOSCCTRL</name>
               <description>External Multipurpose Crystal Oscillator (XOSC) Control</description>
               <addressOffset>0x10</addressOffset>
               <size>16</size>
               <resetValue>0x0080</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTALEN</name>
                     <description>Crystal Oscillator Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GAIN</name>
                     <description>Oscillator Gain</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>GAINSelect</name>
                        <enumeratedValue>
                           <name>GAIN2</name>
                           <description>2 MHz</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN4</name>
                           <description>4 MHz</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN8</name>
                           <description>8 MHz</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN16</name>
                           <description>16 MHz</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GAIN30</name>
                           <description>30 MHz</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AMPGC</name>
                     <description>Automatic Amplitude Gain Control</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STARTUP</name>
                     <description>Start-Up Time</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>STARTUPSelect</name>
                        <enumeratedValue>
                           <name>CYCLE1</name>
                           <description>31 us</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE2</name>
                           <description>61 us</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE4</name>
                           <description>122 us</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE8</name>
                           <description>244 us</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE16</name>
                           <description>488 us</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE32</name>
                           <description>977 us</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE64</name>
                           <description>1953 us</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE128</name>
                           <description>3906 us</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE256</name>
                           <description>7813 us</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE512</name>
                           <description>15625 us</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE1024</name>
                           <description>31250 us</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE2048</name>
                           <description>62500 us</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE4096</name>
                           <description>125000 us</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE8192</name>
                           <description>250000 us</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE16384</name>
                           <description>500000 us</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE32768</name>
                           <description>1000000 us</description>
                           <value>15</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSC16MCTRL</name>
               <description>16MHz Internal Oscillator (OSC16M) Control</description>
               <addressOffset>0x14</addressOffset>
               <size>8</size>
               <resetValue>0x82</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSEL</name>
                     <description>Oscillator Frequency Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FSELSelect</name>
                        <enumeratedValue>
                           <name>4</name>
                           <description>4MHz</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8</name>
                           <description>8MHz</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12</name>
                           <description>12MHz</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16</name>
                           <description>16MHz</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
